# ConnectionInputPointInfo Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectionInputPointInfo Members
ConnectionInputPointInfo Class Constructors Methods Properties See Also
---
The ConnectionInputPointInfo type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ConnectionInputPointInfo()()()() | Construct a default input point. |
| ConnectionInputPointInfo(String, Int32, String) | Construct an input point info. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ConnectionInputPointInfo |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InputMemberIndex | A index of the input member to which the restriction applies. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| PointSelectionText | A string used to select input point by some connections. |
| RestrictionType | A type of input point restriction. |

# See Also
ConnectionInputPointInfo Class
Autodesk.Revit.DB.Structure Namespace